#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/heder24/week25-assignment/runs/run-HWKiKNoZA5W9KN7q

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
module.ec2.data.aws_partition.current: Refreshing...
data.aws_ami.ubuntu: Refreshing...
module.route53.data.aws_route53_zone.this[0]: Refreshing...
module.ec2.data.aws_partition.current: Refresh complete after 0s [id=aws]
data.aws_ami.ubuntu: Refresh complete after 0s [id=ami-073e5edf4b5d15fc8]
module.route53.data.aws_route53_zone.this[0]: Refresh complete after 0s [id=Z10479661QT4EPRK5O3JF]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-073e5edf4b5d15fc8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = false
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "juice"
        }
      + tags_all                             = {
          + "Name" = "juice"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = "IyEvYmluL2Jhc2gKCiNVbmluc3RhbGwgVW5vZmZpY2lhbCB2ZXJzaW9ucyAKCmZvciBwa2cgaW4gZG9ja2VyLmlvIGRvY2tlci1kb2MgZG9ja2VyLWNvbXBvc2UgZG9ja2VyLWNvbXBvc2UtdjIgcG9kbWFuLWRvY2tlciBjb250YWluZXJkIHJ1bmM7IGRvIHN1ZG8gYXB0IHJlbW92ZSAkcGtnIC15OyBkb25lCgojIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjICBTZXQgdXAgRG9ja2VyJ3MgQXB0IHJlcG9zaXRvcnkuICMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIwojIEFkZCBEb2NrZXIncyBvZmZpY2lhbCBHUEcga2V5OgpzdWRvIGFwdC1nZXQgdXBkYXRlIC15CnN1ZG8gYXB0LWdldCBpbnN0YWxsIGNhLWNlcnRpZmljYXRlcyBjdXJsIGdudXBnIC15CnN1ZG8gaW5zdGFsbCAtbSAwNzU1IC1kIC9ldGMvYXB0L2tleXJpbmdzCmN1cmwgLWZzU0wgaHR0cHM6Ly9kb3dubG9hZC5kb2NrZXIuY29tL2xpbnV4L3VidW50dS9ncGcgfCBzdWRvIGdwZyAtLWRlYXJtb3IgLW8gL2V0Yy9hcHQva2V5cmluZ3MvZG9ja2VyLmdwZwpzdWRvIGNobW9kIGErciAvZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnIAoKIyBBZGQgdGhlIHJlcG9zaXRvcnkgdG8gQXB0IHNvdXJjZXM6CmVjaG8gXAogICJkZWIgW2FyY2g9IiQoZHBrZyAtLXByaW50LWFyY2hpdGVjdHVyZSkiIHNpZ25lZC1ieT0vZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnXSBodHRwczovL2Rvd25sb2FkLmRvY2tlci5jb20vbGludXgvdWJ1bnR1IFwKICAiJCguIC9ldGMvb3MtcmVsZWFzZSAmJiBlY2hvICIkVkVSU0lPTl9DT0RFTkFNRSIpIiBzdGFibGUiIHwgXAogIHN1ZG8gdGVlIC9ldGMvYXB0L3NvdXJjZXMubGlzdC5kL2RvY2tlci5saXN0ID4gL2Rldi9udWxsCnN1ZG8gYXB0LWdldCB1cGRhdGUgLXkKCgojaW5zdGFsbCB0aGUgRG9ja2VyIHBhY2thZ2VzLiAKCnN1ZG8gYXB0LWdldCBpbnN0YWxsIGRvY2tlci1jZSBkb2NrZXItY2UtY2xpIGNvbnRhaW5lcmQuaW8gZG9ja2VyLWJ1aWxkeC1wbHVnaW4gZG9ja2VyLWNvbXBvc2UtcGx1Z2luIC15CgoKIyBTdGFydCBhbmQgRW5hYmxlIERvY2tlciAKc3VkbyBzZXJ2aWNlIGRvY2tlciBzdGFydApzdWRvIHNlcnZpY2UgZG9ja2VyIGVuYWJsZQoKI0FkZCB1c2VyIGN5YmVyIHRvIGRvY2tlciBncm91cCBhbmQgVXBkYXRlIERvY2tlciBQZXJtaXNzaW9uIApzdWRvIHVzZXJtb2QgLWEgLUcgZG9ja2VyIGN5YmVyCnN1ZG8gY2htb2QgNjY2IC92YXIvcnVuL2RvY2tlci5zb2NrCgojIFJ1biBPV0FTUCBKdWljZSBTaG9wIENvbnRhaW5lcgoKZG9ja2VyIHB1bGwgYmtpbW1pbmljaC9qdWljZS1zaG9wCmRvY2tlciBydW4gLWQgLXAgODA6MzAwMCBia2ltbWluaWNoL2p1aWNlLXNob3A="
      + user_data_replace_on_change          = true
      + volume_tags                          = {
          + "Name" = "juice"
        }
      + vpc_security_group_ids               = (known after apply)

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

  # module.route53.aws_route53_record.this["juice A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "juice"
      + records         = (known after apply)
      + type            = "A"
      + zone_id         = "Z10479661QT4EPRK5O3JF"
    }

  # module.security-groups.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "juice-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "juice-sg"
        }
      + tags_all               = {
          + "Name" = "juice-sg"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.security-groups.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS to anywhere IPV4"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.security-groups.aws_security_group_rule.egress_with_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP to anywhere IPV4"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.security-groups.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
      + description              = "HTTP to anywhere IPV4"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.security-groups.aws_security_group_rule.egress_with_ipv6_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
      + description              = "HTTPS to anywhere IPV4"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.security-groups.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow HTTPS from public IPV4"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.security-groups.aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow HTTP from public IPV4"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.security-groups.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      + description              = "HTTPS from public IPV6"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.security-groups.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      + description              = "HTTP from public IPV6"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ami_id      = "ami-073e5edf4b5d15fc8"
  + web-address = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @heder24, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*